Revit 2027 API
FileDialog.GetSelectedModelPath Method
 Returns the selected file path chosen by the user.
Namespace: Autodesk.Revit.UI
Assembly: RevitAPIUI (in RevitAPIUI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public ModelPath GetSelectedModelPath()
Public Function GetSelectedModelPath As ModelPath
public:
ModelPath^ GetSelectedModelPath()
member GetSelectedModelPath : unit -> ModelPath
Return Value
ModelPath
 The selected file path, or null if the dialog has not been shown or selection was cancelled.
See Also
Reference
FileDialog Class
Autodesk.Revit.UI Namespace